from datetime import datetime

days = {"2.30" : "Айнешева Эрбола", "19.6" : "Волкову Сашу", "11.8" : "Воронкова Даниила", "23.1" : "Голополосову Дашу",
		"25.1" : "Долгова Глеба", "29.3" : "Калужского Максима", "7.9" : "Креневу Машу", "6.3" : "Лаврова Родиона",
		"5.2" : "Мальцева Илью", "6.5" : "Мамедову Лиану", "23.1" : "Маслову Таню", "18.1" : "Орлова Егора и Сидоренко Настю",
		"5.7" : "Подрядова Степана", "5.4" : "Ранецкого Артёма", "6.1" : "Рябинину Лену", "9.10" : "Уразбаеву Адину",
		"25.11" : "Федина Александра", "29.12" : "Николаеву Арину"}

def checkDay():
	now = datetime.now()
	message = "Поздравляем, {} с Днём рождения! 🥳 🥳 🥳 🎂 🎂 🎂 "
	now_date = str(now.day) + "." + str(now.month)
	for date in days:
		if date == now_date:
			return message.format(days[date])
	return None
